rambalakrishnan/thumbdrive-esp-idf-v6.1/sdkconfig.defaults
# ===========================================================================
# CHANGELOG
# ---------------------------------------------------------------------------
# [v6.1-beta1-migration] 2026-08-18  s.ram.balakrishnan@gmail.com
#   - Added CONFIG_TINYUSB_MSC_ENABLED=y.  Without this, the MSC class is
#     compiled out entirely (CFG_TUD_MSC defaults to 0) and the device will
#     not enumerate as a USB Mass Storage device on the host.
#   - Added CONFIG_TINYUSB_MSC_MOUNT_PATH="/data" to make the mount path
#     explicit (matches the Kconfig default and the value used in main.c).
#   - Added CONFIG_TINYUSB_MSC_BUFSIZE=4096 to match the wear-levelling
#     sector size (CONFIG_WL_SECTOR_SIZE=4096).  The v1.7.6 backend
#     requires CONFIG_TINYUSB_MSC_BUFSIZE >= CONFIG_WL_SECTOR_SIZE at
#     runtime in tinyusb_msc_storage_init_spiflash(); if the buffer is
#     smaller, the init fails with ESP_ERR_NOT_SUPPORTED.  A 4096-byte
#     buffer also improves transfer throughput compared to the 512-byte
#     default.
#
# [usb-boot-n16r8] 2026-08-18  s.ram.balakrishnan@gmail.com
#   - Changed CONFIG_ESPTOOLPY_FLASHSIZE_2MB -> 16MB.  The target hardware
#     is an ESP32-S3 N16R8 module (16 MB flash / 8 MB PSRAM).  The old
#     2 MB config was a leftover from the default ESP-IDF single-app
#     template and is too small to hold the ~15.6 MB storage partition.
#
#   - Added CONFIG_PARTITION_TABLE_CUSTOM=y.  Without this, ESP-IDF falls
#     back to the built-in partitions_singleapp.csv which has no "storage"
#     FAT partition.  app_main() calls esp_partition_find_first(DATA, FAT,
#     "storage") which would return NULL and the firmware would silently
#     bail out on real hardware.  This setting activates partitions.csv.
#
#   - Added CONFIG_PARTITION_TABLE_FILENAME="partitions.csv" to point the
#     build system at our custom partition table (required when
#     CONFIG_PARTITION_TABLE_CUSTOM=y is set).
#
#   - Changed CONFIG_WL_SECTOR_SIZE from 4096 to 512.  The wear-levelling
#     layer exposes its sector size as the USB MSC logical block size via
#     tud_msc_capacity_cb().  BIOS/UEFI firmware expects 512-byte sectors
#     for USB boot devices.  With 4096-byte sectors, most UEFI
#     implementations would reject the device as a boot medium.  The
#     internal flash page size remains 4096; WL simply presents smaller
#     logical sectors, handling sub-page reads/writes in software.
#     CONFIG_TINYUSB_MSC_BUFSIZE (4096) still satisfies the
#     BUFSIZE >= SECTOR_SIZE compile-time check (4096 >= 512).
#
#   - Removed CONFIG_TINYUSB_MSC_MOUNT_PATH="/data".  This Kconfig default
#     is only consumed by the FAT-VFS mount path when mount_point=
#     MOUNT_APP.  The main.c now uses MOUNT_USB which bypasses the FAT
#     mount entirely, so the path is dead.  Left in for documentation of
#     the Kconfig default it replaced.
# ===========================================================================

CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n
CONFIG_LIBC_PICOLIBC=y
# --- USB MSC + storage --------------------------------------------------
# (was: CONFIG_TINYUSB_MSC_MOUNT_PATH="/data" -- removed; see changelog above)
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
# --- Flash + partition table (N16R8 = 16 MB flash) ---------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# --- Wear-levelling sector size (512 for UEFI boot compatibility) ------
CONFIG_WL_SECTOR_SIZE_512=y
